<a href="https://colab.research.google.com/github/raianegoncalves/banco-de-dados/blob/main/DESAFIO_INDIVIDUAL_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**CARREGAR EXTENSÃO SQL PARA USAR**

In [1]:
%load_ext sql

**CRIAR UM BANCO DE DADOS**

In [16]:
%%sql
sqlite:///banco.db

**CRIAR TABELA ALUNOS**

In [17]:
%%sql
CREATE TABLE nome(ID int, Nome Varchar(50), Idade int, Curso Varchar(50));

 * sqlite:///banco.db
Done.

[]

INSERIR 5 REGISTROS NA TABELA **ALUNOS**

In [18]:
%%sql
insert into nome (ID, Nome, Idade, Curso) values (1,'Guilherme Elias Bastos', 29,'Engenheiro(a) Civil');
insert into nome (ID, Nome, Idade, Curso) values (2,'Raiane Cristiane Gonçalves', 28,'Engenheiro(a) Mecânica');
insert into nome (ID, Nome, Idade, Curso) values (3,'Romana Marina', 19,'Médico(a) Pediatra');
insert into nome (ID, Nome, Idade, Curso) values (4,'Raique de Andrade', 23,'Desenvolvedor(a)');
insert into nome (ID, Nome, Idade, Curso) values (5,'Ricardo Gonçalves', 40,'Engenheiro(a) Produção');

 * sqlite:///banco.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

ALTERAR O NOME DA **TABELA**

In [21]:
%%sql
ALTER TABLE nome RENAME TO ALUNOS;

 * sqlite:///banco.db
Done.

[]

**CONSULTAS:**
  - SELECIONAR TODOS OS REGISTROS DA TABELA ALUNOS;
  - SELECIONAR NOME E IDADE DOS ALUNOS COM MAIS DE 20 ANOS;
  - SELECIONAR OS ALUNOS NO CURSO DE ENGENHARIA EM ORDEM ALFABÉTICA;
  - CONTAR O NÚMERO TOTAL DE ALUNOS NA TABELA

In [22]:
%%sql
SELECT * FROM ALUNOS;

 * sqlite:///banco.db
Done.

[(1, 'Guilherme Elias Bastos', 29, 'Engenheiro(a) Civil'),
 (2, 'Raiane Cristiane Gonçalves', 28, 'Engenheiro(a) Mecânica'),
 (3, 'Romana Marina', 19, 'Médico(a) Pediatra'),
 (4, 'Raique de Andrade', 23, 'Desenvolvedor(a)'),
 (5, 'Ricardo Gonçalves', 40, 'Engenheiro(a) Produção')]

In [23]:
%%sql
SELECT Nome, Idade FROM ALUNOS WHERE Idade > 20;

 * sqlite:///banco.db
Done.

[('Guilherme Elias Bastos', 29),
 ('Raiane Cristiane Gonçalves', 28),
 ('Raique de Andrade', 23),
 ('Ricardo Gonçalves', 40)]

In [24]:
%%sql
SELECT * FROM ALUNOS WHERE Curso LIKE '%Engenharia%' ORDER BY Nome;

 * sqlite:///banco.db
Done.

[]

In [25]:
%%sql
SELECT COUNT(*) FROM ALUNOS;

 * sqlite:///banco.db
Done.

[(5,)]

**ATUALIZAÇÃO E REMOÇÃO**
  - ATUALIZE A IDADE DE UM ALUNO ESPECÍFICO NA TABELA;
  - REMOVA UM ALUNO PELO SEU ID;

In [26]:
%%sql
UPDATE ALUNOS SET Idade = 27 WHERE ID = 1;

 * sqlite:///banco.db
1 rows affected.

[]

In [27]:
%%sql
DELETE FROM ALUNOS WHERE ID = 3;

 * sqlite:///banco.db
1 rows affected.

[]

**CRIAR UMA TABELA E INSERIR DADOS**

In [29]:
%%sql
DROP TABLE IF EXISTS CLIENTES;
CREATE TABLE CLIENTES (
    ID INT PRIMARY KEY,
    Nome VARCHAR(50),
    Idade INT,
    Saldo float
);

 * sqlite:///banco.db
Done.
Done.

[]

In [30]:
%%sql
INSERT INTO clientes (id, nome, idade, saldo) VALUES
(1, 'Ana Silva', 30, 2500.75),
(2, 'Carlos Pereira', 45, 3200.00),
(3, 'Maria Oliveira', 28, 1800.50),
(4, 'João Santos', 35, 2700.00);

 * sqlite:///banco.db
4 rows affected.

[]

**CONSULTAS E FUNÇÕES AGREGADAS**
  - SELECIONE O NOME E A IDADE DOS CLIENTES COM IDADE SUPERIOR A 30 ANOS;
  - CALCULE O SALDO MÉDIO DOS CLIENTES;
  - ENCONTRE O CLIENTE COM O SALDO MÁXIMO;
  - CONTE QUANTOS CLIENTES TÊM SALDO ACIMA DE 100;

In [33]:
%%sql
SELECT Nome, Idade FROM CLIENTES WHERE Idade > 30;

 * sqlite:///banco.db
Done.

[('Carlos Pereira', 45), ('João Santos', 35)]

In [34]:
%%sql
SELECT AVG(Saldo) FROM CLIENTES;

 * sqlite:///banco.db
Done.

[(2550.3125,)]

In [35]:
%%sql
SELECT * FROM CLIENTES WHERE Saldo = (SELECT MAX(Saldo) FROM CLIENTES);

 * sqlite:///banco.db
Done.

[(2, 'Carlos Pereira', 45, 3200.0)]

In [36]:
%%sql
SELECT COUNT(*) FROM CLIENTES WHERE Saldo > 100;

 * sqlite:///banco.db
Done.

[(4,)]

**ATUALIZAÇÃO E REMOÇÃO COM CONDIÇÕES**
  - ATUALIZE O SALDO DE UM CLIENTE ESPECÍFICO;
  - REMOVA UM CLIENTE PELO SEU ID;

In [37]:
%%sql
UPDATE CLIENTES SET Saldo = 3000.00 WHERE ID = 2;

 * sqlite:///banco.db
1 rows affected.

[]

In [38]:
%%sql
DELETE FROM CLIENTES WHERE ID = 4;

 * sqlite:///banco.db
1 rows affected.

[]

**JUNÇÃO DE TABELAS:** Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [39]:
%%sql
CREATE TABLE COMPRAS (
    ID INT PRIMARY KEY,
    Cliente_ID INT,
    Produto VARCHAR(50),
    Valor FLOAT,
    FOREIGN KEY (Cliente_ID) REFERENCES CLIENTES(ID)
);

 * sqlite:///banco.db
Done.

[]

In [40]:
%%sql
INSERT INTO COMPRAS (ID, Cliente_ID, Produto, Valor) VALUES
(1, 1, 'Laptop', 1500.00),
(2, 2, 'Smartphone', 800.00),
(3, 1, 'Headphones', 150.50),
(4, 3, 'Mesa', 200.00),
(5, 4, 'Cadeira', 120.00);

 * sqlite:///banco.db
5 rows affected.

[]

**Consulta para Exibir o Nome do Cliente, o Produto e o Valor de Cada Compra**

In [42]:
%%sql
SELECT C.Nome, CO.Produto, CO.Valor
FROM CLIENTES C
JOIN COMPRAS CO ON C.ID = CO.Cliente_ID;

 * sqlite:///banco.db
Done.

[('Ana Silva', 'Laptop', 1500.0),
 ('Carlos Pereira', 'Smartphone', 800.0),
 ('Ana Silva', 'Headphones', 150.5),
 ('Maria Oliveira', 'Mesa', 200.0)]